[InteractiveObjects.NewsSpawner InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[InteractiveObjects.NewsSpawner_Fyrestone InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[InteractiveObjects.NewsSpawner_Fyrestone2 InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[InteractiveObjects.NewsSpawner_Fyrestone3 InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[ItemDefs.ID_MO_NewsEcho1 MissionItemDefinition]
UseFailureCharacterMessage="This can happen %s To use this function."
ItemName="Good news!"
PickupMessage="Is true %s"
UseFailureLevelMessage="To use this item you must be at least %d level.."
UseFailureConstraintsMessage="You can't use it.."
NoManufacturerName="In general"

[ItemDefs.ID_MO_NewsEcho1:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Last exit "Última hora" From Radio Hyperion Verdade.."
NoConstraintText=""
Suffix=""
Prefix=""

[ItemDefs.ID_NewsECHO UsableItemDefinition]
UseFailureCharacterMessage="must... %s This thing."
ItemName="good news!"
PickupMessage="you have %s"
UseFailureLevelMessage="You must be level %d to use this item.."
UseFailureConstraintsMessage="This product is not available."
NoManufacturerName="in general"

[ItemDefs.ID_NewsECHO:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Latest version "Última hora" From the radio "Hyperion".."
NoConstraintText=""
Suffix=""
Prefix=""

